storage/tests/5fe739a7-5040-4ff3-9ce9-ddc816dee50b/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/5fe739a7-5040-4ff3-9ce9-ddc816dee50b/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  01.0s/30s

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  02.0s/30s

running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  03.0s/30s

running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  04.0s/30s

running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  05.0s/30s

running (0m06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  06.0s/30s

running (0m07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  07.0s/30s

running (0m08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  08.0s/30s

running (0m09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  09.0s/30s

running (0m10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  10.0s/30s

running (0m11.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  11.0s/30s

running (0m12.0s), 10/10 VUs, 1 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  12.0s/30s

running (0m13.0s), 10/10 VUs, 4 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  13.0s/30s

running (0m14.0s), 10/10 VUs, 6 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  14.0s/30s

running (0m15.0s), 10/10 VUs, 8 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  15.0s/30s

running (0m16.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  16.0s/30s

running (0m17.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  17.0s/30s

running (0m18.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  18.0s/30s

running (0m19.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  19.0s/30s

running (0m20.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  20.0s/30s

running (0m21.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  21.0s/30s

running (0m22.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  22.0s/30s

running (0m23.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  23.0s/30s

running (0m24.0s), 10/10 VUs, 12 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  24.0s/30s

running (0m25.0s), 10/10 VUs, 12 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  25.0s/30s

running (0m26.0s), 10/10 VUs, 16 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  26.0s/30s

running (0m27.0s), 10/10 VUs, 18 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  27.0s/30s

running (0m28.0s), 10/10 VUs, 19 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  28.0s/30s

running (0m29.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  29.0s/30s

running (0m30.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  30.0s/30s

running (0m31.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s

running (0m32.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s

running (0m33.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s

running (0m34.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s

running (0m35.0s), 09/10 VUs, 21 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s

running (0m36.0s), 09/10 VUs, 21 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s

running (0m37.0s), 09/10 VUs, 21 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s

running (0m38.0s), 06/10 VUs, 24 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s

running (0m39.0s), 01/10 VUs, 29 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s

running (0m40.0s), 01/10 VUs, 29 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s


  █ TOTAL RESULTS 

    checks_total.......: 150    3.744958/s
    checks_succeeded...: 88.66% 133 out of 150
    checks_failed......: 11.33% 17 out of 150

    ✗ status ok
      ↳  88% — ✓ 133 / ✗ 17

    CUSTOM
    api_req_duration...............: avg=143.58ms min=2.88ms med=8.33ms max=982.09ms p(90)=352.72ms p(95)=448.82ms

    HTTP
    http_req_duration..............: avg=143.58ms min=2.88ms med=8.33ms max=982.09ms p(90)=352.72ms p(95)=448.82ms
      { expected_response:true }...: avg=99.99ms  min=2.88ms med=7.63ms max=530.48ms p(90)=299.66ms p(95)=355.67ms
    http_req_failed................: 11.33% 17 out of 150
    http_reqs......................: 150    3.744958/s

    EXECUTION
    iteration_duration.............: avg=12.63s   min=10.39s med=12.26s max=15.72s   p(90)=14.43s   p(95)=15.19s  
    iterations.....................: 30     0.748992/s
    vus............................: 1      min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 83 kB  2.1 kB/s
    data_sent......................: 45 kB  1.1 kB/s



running (0m40.1s), 00/10 VUs, 30 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  30s